Revit 2027 API
BuiltInFailures.SketchFailures.ShortCurveInSketchRoof Property
 The sketch contains an extremely short line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ShortCurveInSketchRoof { get; }
Public Shared ReadOnly Property ShortCurveInSketchRoof As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ShortCurveInSketchRoof {
	FailureDefinitionId^ get ();
}
static member ShortCurveInSketchRoof : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace